In [ ]:
# pandas:pandas is a python library which is used to perform operations on dataset like manipulating,exploring,reading etc..

In [ ]:
#different ways of creating a data frame

In [2]:
import pandas as pd 
#1
df1 = pd.DataFrame({'Aryan':['yes','No'],'Kiran':['yes','yes']},index = ['A','B'])

#2
aryan = ['yes','no']
kiran = ['yes','no']
df2 = pd.DataFrame({'Aryan':aryan,'Kiran':kiran})

#3
lst = [['yes','no'],['no','no']]
df3 = pd.DataFrame(lst,columns =['Aryan','kiran'])

In [29]:
#the list of row labels used in a DataFrame is known as an Index. and indexes can be set using index.
df1

#how to access row labels
df1.index

#how to access column lables
df1.columns

Index(['Aryan', 'Kiran'], dtype='object')

In [5]:

#a series can be labelled as a single column of a data frame where we can assign index same as we do for data frame.
#dataframe can also be called as collection of series.

# to add a new column to a data frame 
#1
df1['age'] = [1,2]
#2
#to add a column to a particular location.
#df1.insert(loc = 4,column = 'Gender1',value = ['M','M'])

In [76]:
#changing the index of a  data frame 
df1.set_index('Gender')

       Aryan Kiran  age Gender1
Gender
M        yes   yes    1       M
M         No   yes    2       M

In [81]:
#using dscribe we can get the range statistics of the data frame 
df1.Aryan.describe()

count       2
unique      2
top       yes
freq        1
Name: Aryan, dtype: object

In [79]:
# to see a list of values of a particular column we can use unique() function.
df1.age.unique()

array([1, 2], dtype=int64)

In [80]:
#o see a list of unique values and how often they occur in the dataset, we can use the value_counts() method:
df1.age.value_counts()

1    1
2    1
Name: age, dtype: int64

In [87]:
#found new way to get column labels using head and tail 

#df1.head(0) or df1.tail(0)

  Aryan Kiran  age Gender Gender1
B    No   yes    2      M       M

In [6]:
#TO RENAME A PARTICULAR COLUMN NAME 
df1.rename(columns = {'age':'Age'})

  Aryan Kiran  Age
A   yes   yes    1
B    No   yes    2

In [11]:
df1.merge(df3)

  Aryan Kiran  age kiran
0   yes   yes    1    no

  Aryan kiran
0   yes    no
1    no    no

In [15]:
import pandas as pd 
data = pd.read_table('nba.txt',delimiter = ",",index_col = 1,na_values = ['##'])
df = pd.DataFrame(data)

,Name,Number,Position,Age,Height,Weight,College,Salary
Team,,,,,,,,
Boston Celtics,Avery Bradley,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Boston Celtics,Jae Crowder,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
Boston Celtics,John Holland,30.0,SG,27.0,6-5,205.0,Boston University,NaN
Boston Celtics,R.J. Hunter,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Boston Celtics,Jonas Jerebko,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...
Utah Jazz,Trey Lyles,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
Utah Jazz,Shelvin Mack,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Utah Jazz,Raul Neto,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Utah Jazz,Tibor Pleiss,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Utah Jazz,Jeff Withey,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [16]:
#df.info()
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 457 entries, Boston Celtics to Utah Jazz
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Number    457 non-null    float64
 2   Position  457 non-null    object
 3   Age       457 non-null    float64
 4   Height    457 non-null    object
 5   Weight    457 non-null    float64
 6   College   373 non-null    object
 7   Salary    446 non-null    float64
dtypes: float64(4), object(4)
memory usage: 32.1+ KB

In [17]:
df.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [32]:
#data type of a particular column is object if it is having mixed data type values.
df.dtypes

Name         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [39]:

df.select_dtypes(exclude = [object])

                Number   Age  Weight     Salary
Team
Boston Celtics     0.0  25.0   180.0  7730337.0
Boston Celtics    99.0  25.0   235.0  6796117.0
Boston Celtics    30.0  27.0   205.0        NaN
Boston Celtics    28.0  22.0   185.0  1148640.0
Boston Celtics     8.0  29.0   231.0  5000000.0
...                ...   ...     ...        ...
Utah Jazz         41.0  20.0   234.0  2239800.0
Utah Jazz          8.0  26.0   203.0  2433333.0
Utah Jazz         25.0  24.0   179.0   900000.0
Utah Jazz         21.0  26.0   256.0  2900000.0
Utah Jazz         24.0  26.0   231.0   947276.0

[457 rows x 4 columns]

In [40]:
df.Number.value_counts()

5.0     23
3.0     21
0.0     20
1.0     20
8.0     19
12.0    17
11.0    17
4.0     17
9.0     16
2.0     16
21.0    15
7.0     14
15.0    14
23.0    13
20.0    12
6.0     12
13.0    12
30.0    11
33.0    11
22.0    11
17.0    10
14.0    10
10.0    10
25.0    10
34.0     9
24.0     8
44.0     8
31.0     8
35.0     7
41.0     6
42.0     6
32.0     5
50.0     5
40.0     5
19.0     4
18.0     4
55.0     4
27.0     3
43.0     3
28.0     3
36.0     2
90.0     2
26.0     2
16.0     2
77.0     2
54.0     1
92.0     1
39.0     1
45.0     1
99.0     1
37.0     1
52.0     1
88.0     1
Name: Number, dtype: int64

In [45]:
import numpy as np 
np.unique(df['Age'])

array([19., 20., 21., 22., 23., 24., 25., 26., 27., 28., 29., 30., 31.,
       32., 33., 34., 35., 36., 37., 38., 39., 40.])

In [48]:
#converting one data type to other 
df['Number'] = df['Number'].astype('int64')

In [51]:
df.info()
#df['Number']

<class 'pandas.core.frame.DataFrame'>
Index: 457 entries, Boston Celtics to Utah Jazz
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Number    457 non-null    int64
 2   Position  457 non-null    object
 3   Age       457 non-null    float64
 4   Height    457 non-null    object
 5   Weight    457 non-null    float64
 6   College   373 non-null    object
 7   Salary    446 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 48.3+ KB

In [54]:
#to find the number of missing values
df.isna().sum()

Name         0
Number       0
Position     0
Age          0
Height       0
Weight       0
College     84
Salary      11
dtype: int64

In [55]:
#to get the total number of missing values
df.isna().sum().sum()

95

In [60]:
#to rename a particular attribute 
df.rename(columns = {'Number':'num'},inplace = True)
df

,Name,num,Position,Age,Height,Weight,College,Salary
Team,,,,,,,,
Boston Celtics,Avery Bradley,0,PG,25.0,6-2,180.0,Texas,7730337.0
Boston Celtics,Jae Crowder,99,SF,25.0,6-6,235.0,Marquette,6796117.0
Boston Celtics,John Holland,30,SG,27.0,6-5,205.0,Boston University,NaN
Boston Celtics,R.J. Hunter,28,SG,22.0,6-5,185.0,Georgia State,1148640.0
Boston Celtics,Jonas Jerebko,8,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...
Utah Jazz,Trey Lyles,41,PF,20.0,6-10,234.0,Kentucky,2239800.0
Utah Jazz,Shelvin Mack,8,PG,26.0,6-3,203.0,Butler,2433333.0
Utah Jazz,Raul Neto,25,PG,24.0,6-1,179.0,NaN,900000.0
Utah Jazz,Tibor Pleiss,21,C,26.0,7-3,256.0,NaN,2900000.0
Utah Jazz,Jeff Withey,24,C,26.0,7-0,231.0,Kansas,947276.0

In [64]:
df.corr(method = 'pearson')

             num       Age    Weight    Salary
num     1.000000  0.028724  0.206921 -0.112386
Age     0.028724  1.000000  0.087183  0.213459
Weight  0.206921  0.087183  1.000000  0.138321
Salary -0.112386  0.213459  0.138321  1.000000

In [65]:
df.isna().sum()

Name         0
num          0
Position     0
Age          0
Height       0
Weight       0
College     84
Salary      11
dtype: int64

In [74]:
mean = df['Salary'].mean()
df.fillna(mean,inplace = True)

In [73]:
df.isna().sum()

Name        0
num         0
Position    0
Age         0
Height      0
Weight      0
College     0
Salary      0
dtype: int64

In [80]:
df['College'].dtypes

dtype('O')

In [81]:
#string cannot be converted to integer
df['College'].astype('int64')

ValueError: invalid literal for int() with base 10: 'Texas'

In [85]:
df.iloc[0:1]

,Name,num,Position,Age,Height,Weight,College,Salary
Team,,,,,,,,
Boston Celtics,Avery Bradley,0,PG,25.0,6-2,180.0,Texas,7730337.0

In [89]:
df.shape

(457, 8)

In [91]:
df.iloc[456:]

                  Name  num Position   Age Height  Weight College    Salary
Team
Utah Jazz  Jeff Withey   24        C  26.0    7-0   231.0  Kansas  947276.0

KeyError: 'Number'